miniproject0/case1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wallL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       34550;
    }
    wallR
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       34950;
    }
    wallExpansion
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       35350;
    }
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       35375;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       35400;
    }
    twoD
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35000;
        startFace       35450;
    }
)

// ************************************************************************* //
